In [1]:
import numpy as np
import pandas as pd

In [2]:
d={
    "Name":['Harpal',"Purvi",'''Vishal''',"""Kinjal"""],
    "Birth":[31,10,11,27],
    "City":["Botad","Rajkot","Ahmedabad","Surendranagar"]
}
d

{'Name': ['Harpal', 'Purvi', 'Vishal', 'Kinjal'],
 'Birth': [31, 10, 11, 27],
 'City': ['Botad', 'Rajkot', 'Ahmedabad', 'Surendranagar']}

In [3]:
df=pd.DataFrame(d)
df

     Name  Birth           City
0  Harpal     31          Botad
1   Purvi     10         Rajkot
2  Vishal     11      Ahmedabad
3  Kinjal     27  Surendranagar

In [4]:
df.to_csv("FriendDetail.csv")

In [5]:
df.describe()

           Birth
count   4.000000
mean   19.750000
std    10.812801
min    10.000000
25%    10.750000
50%    19.000000
75%    28.000000
max    31.000000

In [7]:
s=pd.Series(np.random.rand(30))
s

0     0.582558
1     0.450814
2     0.424762
3     0.039700
4     0.226023
5     0.232549
6     0.531971
7     0.350654
8     0.513982
9     0.079005
10    0.400794
11    0.824966
12    0.504618
13    0.924083
14    0.772647
15    0.461052
16    0.249831
17    0.211707
18    0.517046
19    0.532206
20    0.019783
21    0.769332
22    0.176461
23    0.373686
24    0.472983
25    0.329346
26    0.372751
27    0.629725
28    0.634046
29    0.733286
dtype: float64

In [8]:
type(s)

pandas.core.series.Series